* translation-popup

#+begin_src sh :exports results :results output raw
  echo "Current Version: =$(nix eval --raw .#default.passthru.version)="
#+end_src

#+RESULTS:
Current Version: =0.0.3=

This script stitches together =tesseract= and =translate-shell= to quickly
pop-up language translations.

This script has two main use-cases:

- OCR mode :: This mode prompts you to draw a rectangle around on-screen text
  which you want to translate. This mode is useful for translating subtitles in
  videos or games, or in images.
- Selection mode :: This mode will translate the region of text you currently
  have selected.

The primary motivation of this script is to show translations /quickly/. When
starting to learn a new language, I find that I need to translate words and
phrases constantly—often multiple times per sentence. This makes it important to
be able to bring up a translation in only one or two clicks.

** Desktop Integration

TODO

** Dependencies

- [[https://www.gnu.org/software/coreutils/][coreutils]]
- [[https://flameshot.org/][flameshot]]
- [[https://sw.kovidgoyal.net/kitty/][kitty]]
- [[https://mpv.io/][mpv]]
- [[https://github.com/tesseract-ocr/tesseract][tesseract]]
- [[https://github.com/soimort/translate-shell][translate-shell]]
- [[https://github.com/astrand/xclip][xclip]]

** =--help=

#+begin_src sh :exports results :results output verbatim
  nix run .# -- --help
#+end_src

#+RESULTS:
#+begin_example
Usage: translation-popup [-hvioft]

This shell script facilitates fast machine translation of on-screen text.

Options:
  -h, --help            Print this help and exit.
  -v, --verbose         Enable verbose mode.
  -i, --input=INPUT     Input method [default: ocr].
  -o, --output=OUTPUT   Output method [default: kitty].
  -f, --from-lang=LANG  Input language [default: zh-CN].
  -t, --to-lang=LANG    Output language [default: en].
      --no-ocr-clean    Disable OCR Cleaning.
      --no-ascii        Remove all ASCII characters from the input.

Input methods:
  ocr        Draw a rectangle on the screen and translate text in that area.
  clipboard  Translate the contents of the clipboard.
  selection  Translate the selected text.
  stdin      Translate STDIN.

Output methods:
  kitty   Show the translated text in a kitty window.
  stdout  Write tranlated text to STDOUT.

OCR Cleaning:

  To improve the chance of a good translation, when scanning the screen with
  OCR, this script will attempt to clean up the image before passing it to
  Tesseract:

  - Tesseract requires black text on a white background. If the image is mostly
    dark (and probably white text on a black background), the image colors are
    negated.
  - An attempt is made to remove any background or noise from the image.
  - The image is made b/w.
  - Tesseract recommends that scanned images have a 10 pt white border.

  See these links for more info:

  - https://stackoverflow.com/q/66489314
  - https://www.imagemagick.org/discourse-server/viewtopic.php?t=26571
  - https://imagemagick.org/script/command-line-options.php#lat
  - https://stb-tester.com/blog/2014/04/14/improving-ocr-accuracy
#+end_example
